// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает,
// что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

int number = new Random().Next(10, 1000);

if (number > 100)
{
    Console.WriteLine($" Третьм числом в {number} является число {number % 10}");
}
else 
{
    Console.WriteLine ($"В числе  {number} нет 3-ей цифры");

}